<template>
  <article class='app-box'>
    <aside :class="aside? 'aside':'none-aside'">
      <h1 @click="showAside">{{ catalog }}</h1>
      <ul>
        <li v-for="item in catalogs" :key="item.id">
          <a :href="'#'+item.id">{{ item.text }}</a>
        </li>
      </ul>
    </aside>
    <header>
      <h1>申论的规矩</h1>
    </header>
    <main @click="hideCatalog">
      <section>
        <h2 id="ca1">考察四个能力</h2>
        <h3>1. 阅读理解能力</h3>
        <p>通过阅读获取信息、理解资料的能力。</p>
        <!-- <p>
          要求<span class="err">全面</span>把握给定资料的内容：不要遗漏信息点；
          <span class="err">正确</span>理解给定资料的含义，<span class="err">准确</span>提炼事实所包含的观点：
          作答要以资料为根本，呈现答案时优先用资料中的原词，完全脱离资料阐述自己的观点是不可取的。
        </p> -->
        <h3>2. 综合分析能力</h3>
        <p>在阅读的基础上对资料反映的事件、问题等有进一步思考、理解和剖析的能力。</p>
        <!-- <p>对给定资料的全部或部分内容、观点或问题进行<span class="err">分析和归纳</span>：</p>
        <p>多角度地思考资料内容，做出<span class="err">合理的推断或评价</span>：</p> -->
        <h3>3. 提出和解决问题能力</h3>
        <p>提出对策、解决困难的能力</p>
        <h3>4. 文字表达</h3>
        <P>运用语言文字阐明自己的观点、意见或抒发思想、感情的能力。</P>
      </section>
      <section>
        <h2 id="ca2">答题要素</h2>
        <p>在答题过程中，应先明确答题要素，以便更有针对性地在资料中寻找相关答案信息</p>
        <section>
          <h3>1. 问题</h3>
          <p>主要指负面的现象或事件。比如资料中揭露和抨击社会中的不良作风、腐化思想、错误行为、落后观念等内容。问题往往以消极的词汇来体现。</p>
          <div class="bold">词汇积累：</div>
          <p>{{ catalogs[1].vocabularies[0] }}</p>
        </section>
        <section>
          <h3>2. 危害</h3>
          <p>危害是指问题所带来的一些负面的、消极的、恶劣的社会影响，强调的是一种不好的结果。</p>
          <div class="bold">标志性表述：</div>
          <p>{{ catalogs[1].vocabularies[1] }}</p>
          <div class="bold">词汇积累</div>
          <p>{{ catalogs[1].vocabularies[2] }}</p>
        </section>
        <section>
          <h3>3. 意义</h3>
          <p>意义只指事件或政策带来的好的、积极的、正面的影响和作用。</p>
          <div class="bold">标志性表述：</div>
          <p>{{ catalogs[1].vocabularies[3] }}</p>
        </section>
        <section>
          <h3>4. 对策</h3>
          <p>对策是指针对问题所提出的一些解决方法、建议、举措等。</p>
          <div class="bold">标志性表述（通常为动宾结构）：</div>
          <p>{{ catalogs[1].vocabularies[4] }}</p>
          <p>对策性资料经常出现在政策文件、官员和学者讲话中。</p>
        </section>
        <section>
          <h3>5. 事例</h3>
          <p>事例是近年申论资料的重要组成部分，并逐渐成为题目的作答要素。当看到一些题目要求中出现
            “论据充实，有理有据”等字眼时，就要注意运用资料中的事例作为论据，进行论证。当资料大篇幅地
            描述案例事，案例可能占分值，一般情况下，我们也要对案例予以概括。对事例的概括要简洁明了，
            无须做细节性的赘述。
          </p>
        </section>
        <section>
          <h3>6. 态度</h3>
          <p>态度往往是指某种现象、某种观点进行表态。当题干要求中出现了“观点明确”这样的字眼时，则往往意味着我们要进行表态。</p>
          <div class="bold">常见的表态形式：</div>
          <p>1、赞同的：科学的、合理的、全面的、支持的；</p>
          <p>2、反对的：不科学的、不合理的、不支持的、偏颇的、偏激的、绝对的、片面的；</p>
          <p>3、辩证看待、未知的：有积极方面，也有消极方面、有待考证、尚未定论。</p>
          <p>什么人 + 做了什么事 + 反映了什么品质。比如：“信守承诺、诚信仁义”的孙氏兄弟按时发放农民工工钱。</p>
        </section>
      </section>
      <section>
        <h2 id="ca3">四种题型</h2>
        <p>根据对要素提问明确与否 及 作答内容的不同 划分题型</p>
        <section>
          <h3>1. 单一题</h3>
          <p>有的题干直接告诉考生作答的要素，对于这种提问明确且需要作答一个或少个要素的题目，我们称之为单一题。</p>
        </section>
        <section>
          <h3>2. 综合题</h3>
          <p>对于提问要素模糊，或同一问中包含较多个要素的题目，我们称之为综合题。</p>
        </section>
        <section>
          <h3>3. 公文写作题</h3>
          <p>往往要求写一份材料，如提纲、编者按、倡议书、通知、新闻稿等。公文写作题是在综合题的基础上披上了形式的外衣，并增加了对格式、语言的要求。</p>
        </section>
        <section>
          <h3>4. 作文题</h3>
          <p>往往是申论的最后一题，要求结合资料写作成文。一般来说，作文要符合观点明确、结构完整、论证充足、语言流畅等具体要求。</p>
        </section>
      </section>
      <section>
        <h2 id="ca4">申论答题步骤</h2>
        <h3>1. 审题（确定作答方向）</h3>
        <div class="bold">如何审题？</div>
        <p>（1）审作答范围。作答范围即资料范围。</p>
        <p>（2）审作答主题与结构。作答主题即题干是围绕什么话题展开的。结构则是根据题干对答题内容进行预判，如答什么要素、怎么排布等。</p>
        <p>（3）审作答要求。</p>
        <div class="bold">有哪些作答要求？</div>
        <p>（1）准确：①要点来自资料；②最好使用资料原词原句，或在原词原句的基础上进行改造。</p>
        <p>（2）全面：确保无遗漏，多抄关键词，宁滥勿缺。</p>
        <p>（3）简明：言简意赅，去掉修饰词，留下核心的主谓宾短语、动宾短语等。</p>
        <p>（4）有条理：分条撰写，并标清序号。</p>
        <p>（5）观点明确：明确观点或态度，一般需要总结与表态。</p>
        <p>（6）层次清楚：分类、分段呈现答案。</p>
        <p>（7）有针对性：提出的建议或对策要针对某一问题或事件。</p>
        <p>（8）有理有据：既要有理论依据，又要有事实依据，一般要答出事例。</p>
        <p>（9）内容具体：答案内容不空洞、不抽象，细节具体。</p>
      </section>
    </main>
  </article>
</template>

<script>
export default {
  data() {
    return {
      catalogs: [
        { id: 'ca1', text: '考察四个能力' },
        { id: 'ca2', text: '六大答题要素', vocabularies: [
          `（处理、监督）不到位、（处理）不及时、（资金）不足、（法律）不完善、（规划）不科学、（监管）缺乏、
          （垃圾回收设施）少、（垃圾分类）意识薄弱、（规划）不合理、（选址）不当`,
          `不利于（）、影响了（）、损害了（）、破坏了（）、引发（交通事故）、导致（视力下降）、会让（很多人出现健康问题）
          诱发（疾病）、（）的负面影响`,
          `产生（安全隐患）、影响（人际交往）`,
          `有利于（）、改善了（）、增强了（）、促进了（）、缓解了（）、推动了（）`,
          `加强（）、提高（）、建立（）、完善（）、制定（）、转变（）、强化（）`
        ] },
        { id: 'ca3', text: '四种题型' },
        { id: 'ca4', text: '申论答题步骤' },
        { id: 'ca5', text: '在交叉轴上的对齐方式' },
        { id: 'ca6', text: '排列方式' },
      ],
      aside: false,
      catalog: '目录'
    }
  },
  methods: {
    showAside() {
      this.aside = !this.aside
      this.aside ? this.catalog = '隐藏' : this.catalog = '目录';
    },
    hideCatalog() {
      this.aside = false
      this.catalog = '目录'
    }
  }
}
</script>

<style lang='scss'>

</style>
