<template>
  <article  >
    <aside :class="aside? 'aside':'none-aside'">
      <h1 @click="showAside">{{ catalog }}</h1>
      <ol>
        <li v-for="item in catalogs" :key="item.id">
          <a :href="'#'+item.id">{{ item.text }}</a>
          <div v-if="item.children">
            <div v-for="el in item.children" :key="el.id" class="padding-left10">
              <a :href="'#'+el.id">{{ el.text }}</a>
              <div v-if="el.items">
                <div v-for="list in el.items" :key="list.id">
                  <a :href="'#'+list.id">{{ list.text }}</a>
                </div>
              </div>
            </div>
          </div>
        </li>
      </ol>
    </aside>
    <section @click="hideCatalog">
      <p>抄材料中的核心词，不要抄段落。（60%）</p>
      <p>把材料中说的啰嗦的段落，用自己的词分析归纳。（30%）</p>
      <p>根据材料描述的某部分，分析推导成问题想要的答案。（10%）</p>
      <section>
        <h2 id="ca1">速算技巧：</h2>

        <h3 id="ch1-1">1. 小技巧</h3>
        <p>（1）一个数×1.5=本身+本身的一半</p>
        <p>（2）一个数×1.1=错位相加</p>
        <p>（3）一个数×0.9=错位相减</p>

        <h3 id="ch1-2">2. 截位直除（除法计算技巧）</h3>
        <p>步骤：先看选项，若差距大，截两位；差距小，截三位；一步除法，截分母；多步计算，上下截。</p>
        <div class="bold">差距大？</div>
        <p>（1）首位都不同；（2）首位有相同，次位差>首位</p>
        <div class="bold">差距小？</div>
        <p>次位差 小于等于 首位</p>
        <div class="bold">截两位？截三位？</div>
        <p>12345截两位：12000，截三位：12300【也讲究四舍五入】；0.45678截两位：0.46，截三位：0.457【同样四舍五入】</p>
        <div class="bold">截谁？</div>
        <p>一步除法，截分母：12345/34567截两位：12345/35000</p>
        <p>多步除法，都要截：12345/34567×13925/24072截两位：12000/35000×14000/24000</p>
        <p class="err">注：若选项之间存在10倍的关系时，要注意判定数量级（几位数）。</p>

        <h3 id="ch1-3">3. 分数比较（除法比较技巧）</h3>
        <p>分子分母各比较，一大一小，直接比，分子大则大。3/7和2/9：3比2大，7比9小，3大所以3/7大。</p>
        <p>分子分母各比较，同大同小，两方法：</p>
        <p>（1）竖着直接除【转换成小数】；（2）横着看速度[倍数]，小的看成1【15/24和5/12：15是5的3倍，24是12的2倍，就可看成是15/1和5/1，所以前面那个大】</p>
      </section>
      <section>
        <h2 id="ca2">快速找数</h2>
        <p>内容：纯文字型材料、图表型材料</p>
        <h3>文字型材料</h3>
        <p>看：时间、关键词</p>
        <h3>图表型材料</h3>
        <p>看：表头【时间、主体、单位】；饼状图还看分类</p>
        <h3>坑点</h3>
        <p>（1）查找数据时要注意 总计 算不算</p>
        <p>（2）单位【民航、人口（注意千分号）】</p>
      </section>
      <section>
        <h2 id="ca3">基期和现期</h2>
        <p>基期：时间靠前【作为对比参照】；现期：时间靠后【相对于基期】</p>
        <p>增长量：+单位；增长率：+%</p>
        <p>同比：与<span class="red">上年</span>同期相比</p>
        <p>环比：与紧紧相邻的上一统计周期相比（月环比，季度环比）</p>
        <p>顺差：出口 - 进口 > 0</p>
        <p>逆差：出口 - 进口 &lt; 0</p>
        <p>同比增长趋势：与上一年一样的增长率</p>

        <h3 id="ch3-1">基期公式</h3>
        <p>（1）基期 = 现期 + 增长量；</p>
        <p>（2）基期 = 现期 / (1 + 增长率)【常考】</p>

        <h3 id="ch3-2">化除为乘</h3>
        <div class="bold">什么时候用？</div>
        <p>求基期时；选项差距小；增长率的绝对值小于等于5%；增长率为负（分母为0.9几）</p>
        <div class="bold">怎么用？</div>
        <p>A/(1-r) ≈ A×(1+r) = A+A×r</p>

        <h3 id="ch3-3">基期和差</h3>
        <div class="bold">什么时候用？</div>
        <p>求顺差、逆差时；</p>
        <div class="bold">怎么用？</div>
        <p>以坑止坑：（1）先看正负，即比较两个分数的大小；（2）再看现期，直接分子相减，算出来的数就是坑。
          以坑止坑不好用再用截位直除。
        </p>

        <h3 id="ch3-4">现期公式</h3>
        <p>（1）现期 = 基期 + 增长量；（2）现期 = 基期 × (1+增长率)</p>
      </section>
      <section>
        <h2 id="ca4">常见词语辨析</h2>
        <p>百分数：表示两个量的比例关系，用除法计算；</p>
        <p>百分点：表示百分数的变化，用加减法计算。由两个百分数作差得来；</p>
        <p>增长量：= 现期/(1+r)×r，速算：①增长率百化分，r=1/n；②增长量=现期/(n+1)，减少量=现期/(n-1)；增长量比较口诀：
          【大大则大（现期大，增长率大，则增长量大），一大一小百化分】</p>
        <p>增长率【增速、增幅、增值率】：增长率 = (现期 - 基期)/基期；</p>
        <p>倍数：是几倍=A/B，多几倍（增长率）= (A - B)/B = A/B - 1 = 倍数 - 1</p>
        <p>增长率和倍数的关系：倍数 = 增长率 + 1</p>
        <p>成数：几成相当于十分之几；</p>
        <p>番数：翻了几番。遇番数，化倍数，翻N番，变为原来的2<sup>N</sup>倍；</p>
        <p>增长率：可正可负，带符号比较；</p>
        <p>降幅：必须为负，不带符号比较；</p>
        <p>变化幅度【变幅】：可正可负，不带符号比较；</p>
        <div class="bold">特殊增长率</div>
        <p>间隔增长率：间隔r = r1 + r2 + r1×r2；速算：若r1、r2绝对值均小于10%时，r1×r2可忽略，不能忽略则一个不变，另一个百化分（乘积保留一位有效数字即可）。</p>
        <p>间隔倍数：= 间隔r + 1</p>
        <p>间隔基期：= 现期/（1 + 间隔r）</p>
        <P>年均增长量：= （现期-基期）/N，其中N为年份差</P>
        <p>年均增长率：（1+r）<sup>n</sup> = 现期/基期，其中n为现期和基期的年份差【年份差一样时，直接比 现期/基期就可以。】【基期：2011年，现期：2015年，年分差：4】
        【五年规划：十二五期间（2011年-2015年），基期往前推一年：（基期：2010年，现期2015年，年份差为5）】。</p>
        <p>混合增长率：（1）进口+出口=进出口；（2）房产+地产=房地产；（3）1-11月+12月=全年；（4）是+非=全部。【口诀：①混合后居中
          （最大r > 混合r > 最小r）；②偏向基数较大的（基数为基期量，做题时拿现期代替基期估算）。口诀不好用了，就用线段法：
          长度（增速差）与量（基期量，基期量不好求，拿现期量代替估算）成反比，如果基数和期数都没给，选不确定。】</p>
        <p>求增长率却没数 的时候求混合增长率。</p>
      </section>
      <section>
        <h2 id="ca5">比重相关</h2>
        <p>比重提问方式：...占...；...中...的占比</p>
        <p>比重公式： = 部分/总体</p>
        <p>引申概念：利润率 = 利润/收入；增长贡献率 = 部分的增长量/总体的增长量</p>
        <p class="err">注意：千万不能分子分母搞反</p>

        <h3 id="ch5-1">现期比重</h3>
        <p>现期比重 = A/B = 部分的现期量/总体的现期量</p>

        <h3 id="ch5-2">基期比重</h3>
        <p>基期比重 = A/B×(1+b)/(1+a) = 部分的现期量/总体的现期量×(1+总体的增长率)/(1+部分的增长率)</p>
        <p>速算：①先截位直除A/B，②再看(1+b)/(1+a)与1的关系（>，&lt;，=），结合选项选答案。</p>

        <h3 id="ch5-3">两期比重</h3>
        <div class="bold">比较：</div>
        <p>遇两期比重比较，看a（部分增速）和b（总体增速）大小：</p>
        <p>（1）a > b，今年比重上升；</p>
        <p>（2）a &lt; b，今年比重下降；</p>
        <p>（3）a = b，今年比重不变。</p>
        <div class="bold">计算：</div>
        <p>提问方式：两个时期 + 比重 + 上升/下降 + 多少个百分点</p>
        <p>现期比重 - 基期比重 = A/B - A/B×(1+b)/(1+a) = A/B×(a-b)/(1+a) = A/B×1/(1+a)×(a-b) &lt; |a-b|</p>
        <p>速算：①判方向【a>b，上升；a&lt;b，下降】；②定大小：&lt;|a-b|</p>
      </section>
      <section>
        <h2 id="ca6">倍数相关</h2>
        <p>识别：时间 + 倍数</p>
        <p>最先看问法</p>

        <h3 id="ch6-1">现期倍数</h3>
        <p>提问方式：①是几倍【直接除】；②多几倍【减去1】</p>
        <p>现期倍数 = A/B</p>

        <h3 id="ch6-2">基期倍数</h3>
        <p>基期倍数 = A/B×(1+b)/(1+a)，先截位直除A/B，再看(1+b)/(1+a)与1的关系【和基期比重的公式一样】</p>
        <p class="err">审题【多几倍，年份（是求现期倍数还是基期倍数）】和看表【增长率和增长】很重要</p>
      </section>
      <section>
        <h2 id="ca7">平均数相关</h2>

        <h3 id="ch7-1">现期平均数</h3>
        <p>识别：问题时间与材料一致+平均（均/每/单位）</p>
        <p>公式：平均数 = A/B = 总数/个数</p>
        <p>列式方法：后/前；比如：人均收入=收入/人数、每亩产量=产量/亩数、单位面积产量=产量/面积</p>
        <p>速算：截位直除</p>
        <p class="err">注意求月均、日均，然后资料中给的是全年的题</p>
        <p>求一堆的的平均值：削峰填谷：找一个数（相对居中好算），算其他的+5，-16，+7...如果加起来为0就是平均数，如果大于0，多的部分求平均值，加到找的那个数上就是要求的平均值。</p>
        <p>求大于小于由多少的题太难算时，可以先列个式子，然后转化为好算的式子：</p> 
        <p>【例如：给“12月”和“全年”的数据，让比较“12月”和“1-11月的平均值”】</p>
        <p>【方法：直接比较“12月”与“全年的平均值” 或者 直接比较“12月×12”与“全年”】</p>
        <p>求高于平均数的数值，结合选项，对数值进行排序，如选项有四个数值，就从高到低选出前四个数值。</p>
        
        <h3 id="ch7-2">基期平均数</h3>
        <p>识别：求上一年的平均数</p>
        <p>公式：基期平均数 = A/B×(1+b)/(1+a) = 现期总量/现期数量×(1+数量的增长率)/(1+总数的增长率)【和基期倍数公式一样】</p>
        <p>速算：（1）截位直除（多步除法）（2）先算A/B，再看(1+b)/(1+a)与1的关系</p>
        <p class="err">注意：截位直除，一步除法，只截分母，多步除法才分子分母都截。</p>

        <h3 id="ch7-3">两期平均数</h3>
        <div class="bold">比较：</div>
        <p>识别：两个时期+平均数+上升/下降</p>
        <p>遇两期平均比较，看a（分子增数）和b（分母增数），a>b上升,a&lt;b下降，a=b一样</p>
        <div class="bold">计算：</div>
        <p>两个时期+平均+上升/下降+百分之几</p>
        <p>公式：平均数的增长率 = (a-b)/(1+b)</p>
        <p>不能选最小，只能套公式。</p>
        <p class="err">当分母是0.9几时，一定不要硬算，结合选项看分子，答案一定比分子大，但是不能大太多，大太多不合理
          （看提问方式那里有没“约”）。</p>
      </section>
      <section>
        <h2 id="ca8">简单计算</h2>
        <p>（1）尾数计算</p>
        <p>（2）10个以下小数相加，可以整数部分，小数部分分开算，先算整数部分，看选项，明显能选出来就不算小数部分了。</p>
        <p>（3）千位数相加也一样，可以先加千百位数，再加个十位数。</p>

        <h3 id="ch8-1">加减计算</h3>
        <p>（1）精确计算：尾数法，如果末一位相同，则尾两位计算。</p>
        <p>（2）选项是范围：根据选项精度，多截一位计算。</p>
        <p>（3）多个小数相加：先加整数，后加小数。</p>

        <h3 id="ch8-2">排序问题</h3>
        <div class="bold">排序问题四要素：</div>
        <p>（1）时间：现期还是基期</p>
        <p>（2）主体：主体要看清</p>
        <p>（3）单位：单位要一致</p>
        <p>（4）顺序：从大到小？从小到大？</p>
        <p>技巧：从最大最小入手</p>
        <p>答题步骤：先看四要素</p>
        <div class="bold">概念陷阱：</div>
        <p>（1）近、将近：小于但很接近</p>
        <p>（2）超过：大于</p>
        <p>（3）约：可左可右</p>
        <p>（4）持续增长、逐年增长：每一年都要比上一年增长</p>
        <p>（5）增长趋势：一般看首尾</p>
        <p>（6）说比重，一定要有明显的整体与部分的关系，不能说男生占女生的比重</p>
        <p>（7）不足一年：当年新增加的【我学行测不足一年，那我就是今年新学的行测】</p>
      </section>
    </section>
  </article>
</template>

<script>
export default {
  name: '',
  data() {
    return {
      createTime: '2019-03-13 10:21:00',
      aside: false,
      catalog: '目录',
      catalogs: [
        { id: 'ca1', text: '速算技巧：', children: [
          { id: 'ch1-1', text: '小技巧' },
          { id: 'ch1-2', text: '截位直除（除法计算技巧）' },
          { id: 'ch1-3', text: '分数比较（除法比较技巧）' },
        ]},
        { id: 'ca2', text: '快速找数', children: [
        ] },
        { id: 'ca3', text: '基期和现期', children: [
          { id: 'ch3-1', text: '基期公式' },
          { id: 'ch3-2', text: '化除为乘' },
          { id: 'ch3-3', text: '基期和差' },
          { id: 'ch3-4', text: '现期公式' },
        ]  },
        { id: 'ca4', text: '常见词语辨析', children: [
        ]},
        { id: 'ca5', text: '比重相关', children: [
          { id: 'ch5-1', text: '现期比重' },
          { id: 'ch5-2', text: '基期比重' },
          { id: 'ch5-3', text: '两期比重' },
        ] },
        { id: 'ca6', text: '倍数相关', children: [
          { id: 'ch6-1', text: '现期倍数' },
          { id: 'ch6-2', text: '基期倍数' },
        ] },
        { id: 'ca7', text: '平均数相关', children: [
          { id: 'ch7-1', text: '现期平均数' },
          { id: 'ch7-2', text: '基期平均数' },
          { id: 'ch7-3', text: '两期平均数' },
        ] },
        { id: 'ca8', text: '简单计算', children: [
          { id: 'ch8-1', text: '加减计算' },
          { id: 'ch8-2', text: '排序问题' },
        ] }
      ]
    }
  },
  components: {
    
  },
  mounted() {
    
  },
  computed: {
    
  },
  methods: {
    showAside() {
      this.aside = !this.aside
      this.aside ? this.catalog = '隐藏' : this.catalog = '目录';
    },
    hideCatalog() {
      this.aside = false
      this.catalog = '目录'
    }
  }
}
</script>

<style scoped lang="scss">

</style>
