<template>
  <div  >
    <aside :class="aside? 'aside':'none-aside'">
      <h1 @click="showAside">{{ catalog }}</h1>
      <ol>
        <li v-for="item in catalogs" :key="item.id">
          <a :href="'#'+item.id">{{ item.text }}</a>
          <div v-if="item.children">
            <div v-for="el in item.children" :key="el.id" class="padding-left10">
              <a :href="'#'+el.id">{{ el.text }}</a>
              <div v-if="el.items">
                <div v-for="list in el.items" :key="list.id">
                  <a :href="'#'+list.id">{{ list.text }}</a>
                </div>
              </div>
            </div>
          </div>
        </li>
      </ol>
    </aside>
    <main @click="hideCatalog">
      <p>四大题型：1、图形推理；2、类比推理；3、定义判断；4、逻辑判断</p>
      <section>
        <h2 id="ca1">图形推理</h2>
        <div class="bold">命题形式：</div>
        <p>1、一组图：从左往右（优先），135，246；
          2、两组图：分开找规律，第一组图找到规律，第二组图运用规律；
          3、九宫格：横着90%（第一行找规律，第二行验证，第三行用）、竖着；
          4、分组分类：比如给六个图，1 2 3一类，4 5 6一类<span class="err">（不优先考虑一组中心对称，一组不是中心对称【这不算规律】）</span>；
          5、空间类：</p>
        <div class="bold">考点：</div>
        <p>1、位置规律；2、样式规律；3、属性规律；4、数量规律；5、空间重构</p>
        <div class="bold">如何快速定位考点？</div>
        <p>观察 图形特征。</p>
        <p>（1）观察元素组成是否相同：相同【位置规律】；</p>
        <p>不相同（2）观察元素组成是否相似：相似【样式规律】；</p>
        <p>也不相似（3）优先考虑【属性规律】（属性比较好看出来）；</p>
        <p>（4）其次考虑【数量规律】</p>

        <section>
          <h3 id="ch1-1">1. 位置规律</h3>
          <div class="bold">特征：</div>
          <p>元素组成相同（比如都由小黑三角形和小白三角形组成）</p>
          <div class="bold">考点：</div>
          <p>1、平移：</p>
          <p>（1）方向：直线【上下、左右、斜对角线】；绕圈【顺逆时针】</p>
          <p>（2）方向确定后，看步数：恒定；递增【等差】</p>
          <p>2、旋转、翻转：</p>
          <p>（1）旋转：方向【顺、逆时针】；方向确定后，看常见角度【45、90、180】【肉眼可辩】</p>
          <p>（2）翻转：左右翻转一样【图形沿竖轴对称】；上下翻转一样【图形沿横轴对称】</p>
        </section>

        <section>
          <h3 id="ch1-2">2. 样式规律</h3>
          <div class="bold">特征：</div>
          <p>元素组成相似：（1）元素重复出现；（2）线条重复出现</p>
          <div class="bold">考点:</div>
          <p>1、遍历（九宫格和两组图中居多）：缺啥补啥。</p>
          <p>（1）看外形；</p>
          <p>（2）看填补填充图案。</p>
          
          <p>2、加减同异（可能和位置规律符合考察）：</p>
          <p>（1）相加、相减：图1的线条+图2的线条=图3的线条；</p>
          <p>（2）求异（去同求异）：图1的线条+图2的线条-图1图2一样的地方=图3的线条；</p>
          <p>（3）求同（去异求同）：图1的线条+图2的线条-图1图2不一样的地方=图3的线条。</p>
          
          <p>3、黑白运算：</p>
          <p>（1）特征：图形轮廓和分割区域都相同，不同区域“黑白”颜色不同，且黑块数量不成规律【如果数量一样，优先考虑位置平移规律】；</p>
          <p>（2）方法：相同位置运算【都找左上角，都找右上角...】。</p>
        </section>

        <section>
          <h3 id="ch1-3">3. 属性规律</h3>
          <div class="bold">特征：</div>
          <p>元素组成不相同、不相似：元素没有共性，优先考虑属性。</p>
          <div class="bold">考点:</div>
          <p>1、对称性（考的多，做不出来时考虑）：</p>
          <p>（1）轴对称【五角星、箭头、等边三角形、等腰三角形】：方向【横着对称、竖着对称、斜着对称】；数量【五角星有五条对称轴】；</p>
          <p>（2）中心对称：绕某个点旋转180度重合，不确定就转卷子【N Z S 平行四边形】。</p>
          
          <p>2、曲直性：</p>
          <p>（1）全曲线【月亮、笑脸】；</p>
          <p>（2）全直线；</p>
          <p>（3）曲 + 直（考的少）。</p>
          
          <p>3、开闭性【一个好好的图形开了个口，优先考虑开闭性】：</p>
          <p>（1）全封闭【把一只小仓鼠选放在图形里面，出不来就是全封闭】；</p>
          <p>（2）全开放。</p>
        </section>

        <section>
          <h3 id="ch1-4">4. 数量规律</h3>
          <div class="bold">特征：</div>
          <p>元素组成不相同、不相似，数量规律明显</p>
          <div class="bold">考点:</div>
          <p>点、线、角、面、素【元素】</p>
          <p>1、点数量【线和线的交点、切点算，端点不算】：</p>
          <p>（1）特征：线条交叉明显；乱糟糟的一团线交叉；相切较多。</p>
          <p>（2）【特殊考点：数曲直交点】所有点都数无规律，那就看曲直交点数。</p>

          <p>2、线数量【线条数】：</p>
          <p>特征：“五角星”；“日”、“田”及其变形；圆相切、相交；出现明显端点。</p>
          <p>（1）直线数：多边形、单一直线；</p>
          <p>（2）曲线数【光滑画过来的算一条，明显被折的算分开数】：全曲线图、圆、弧。</p>
          <p>（3）【特殊考点：笔画问题】是否能一笔画成【圆相切、相交一定是一笔画图形】：
          <p>一笔画成只要满足两个条件：（1）线条之间连通；
            （2）奇点数=2或=0（<span class="err">端点一定是奇点</span>）【奇点：发射出奇数条线的点】</p>
          <p>能多笔画成的图形：笔画数=奇点数/2【任何图形的奇点数一定是偶数个】（ <span class="err">注意：端点一定不能忘</span> ）。</p>
          
          <p>3、角数量</p>
          <p>特征：扇形、折线较多、改造图（构图不完整、留小缺口）【先看开闭性，再数角】</p>
          <p>（1）什么是角？直线与直线相交才是角（直线与曲线相交不是角）；小于180度的角；角不能重复数【学的时候都能重复数】</p>

          <p>4、面数量</p>
          <p>特征：图形被分割、封闭面明显；生活化图形、粗线条图形中留白区域【先看开闭性，再数面】。</p>
          <p>（1）什么是面？封闭空间（不封闭是0个面）；面是白色的，不是黑色的（因为封闭空间肯定是用黑线画的）。</p>
          <p>【特殊考点：每个面的形状；最大面的形状。】</p>
          
          <p>5、素数量</p>
          <p>特征：出现多个小图形；生活化图形、粗线条图形【先看对称性、封闭性，有明显面则数面，多个小图形数部分数】。</p>
          <p>（1）元素种类</p>
          <p>（2）元素个数</p>
          <p>（3）部分数（线条与线条连在一起叫一部分，黑色部分，黑色线条连在一起也算一部分）</p>
        </section>

        <section>
          <h3 id="ch1-5">5. 空间重构</h3>
          <p>使用技巧来排除错误答案。</p>
          <p>感觉我可以就没记录方法。</p>
        </section>
      </section>
      <section>
        <h2 id="ca2">类比推理</h2>
        <p>给出<span class="err">一组相关的词</span>，要求通过观察分析，在备选答案中找出一组与之在逻辑关系上<span class="err">最为贴近或相似</span>的词。</p>
        <div class="bold">常见题型：</div>
        <p>1. 两词形【A：B】</p>
        <p>2. 三词形【A：B：C】</p>
        <p>3. 填空形【A相对于（）相对于（）对于B】</p>
        <section>
          <h3 id="ch2-1">1. 语义关系</h3>
          <p>难点：不清楚成语意思【解决方法：积累】；只能先排除两个【解决方法：进行二级辨析：看感情色彩（褒义、贬义、中性）】</p>
          <div class="bold">1. 近义关系、反义关系</div>
          <p>（1）近义关系：开心：高兴；言不由衷：口是心非。</p>
          <p>（2）反义关系：勤奋：懒惰；一丝不苟：粗枝大叶。</p>
          <p>特殊：成败【拆词：成和败（反义关系）】；呼吸【呼和吸】</p>

          <div class="bold">2. 比喻义、象征义</div>
          <p>月亮：月盘；松鹤：长寿。【需要积累，起码真题考过的要知道】</p>
        </section>
        <section>
          <h3 id="ch2-2">2. 逻辑关系（10道类比题里面7、8道题是逻辑）</h3>
          <div class="bold">考点：</div>
          <p>1. 全同关系（A===B）：浪漫：罗曼蒂克；老鼠：耗子；调羹：勺子。</p>

          <p>2. 并列关系</p>
          <p>（1）矛盾关系（要么...要么...(没有第三种可能)）：生：死【也可以是反义关系】；对称：不对称。</p>
          <p>（2）反对关系（可以是...可以是...(还可能是第三种情况)）：红色：白色；苹果：香蕉；扇子：空调【有相同或相似的功能也可以看成并列】。</p>
          
          <p>3. 包容关系</p>
          <p>（1）种属关系：A是B的一种【苹果：水果】</p>
          <p>（2）组成关系：A是B的一个组成部分【轮胎：汽车；针筒是注射器的组成部分】</p>
          
          <p>4. 交叉关系（比较难的考点）</p>
          <p>并交补的交【两者之间有关系，但不全等A==B】</p>
          <p>有的A是B，有的A不是B；有的B是A，有的B不是A。【这句活都能说通就是交叉关系：女士：公务员】</p>
          
          <p>5. 对应关系</p>
          <p>（1）材料：小麦：馒头；羊毛：毛线；棉花：布。</p>
          <p>（2）工艺：白酒：发酵。</p>
          <p>工艺特殊：排除到最后剩：玉石：雕琢：玉器【物理变化】；粮食：发酵：白酒【化学变化】</p>
          <p>涉及物理变化的工艺：捆扎、打磨、雕琢、剪裁、织造等。</p>
          <p>涉及化学变化的工艺：燃烧、氧化、发酵、酿造、冶炼等。</p>
          <p>物理、化学区别：有无新物质生成。</p>
          <p>（3）功能：手机：通讯。</p>
          <p>（4）属性/特点：糖：甜。“属性”二级辨析：必然【A一定是B样的】/或然属性</p>
          <p>（5）时间顺序：购票：乘车【先购票，再乘车】。“时间顺序”二级辨析：行为发出的主体。</p>
          <p>（6）必要条件：沸点：沸腾【只有达到沸点，才会沸腾】。</p>
          <p>（7）因果：炎热：中暑。</p>
          
        </section>
        <section>
          <h3 id="ch2-3">3. 语法关系（最简单）</h3>
          <p>技巧：造句子。</p>
          <div class="bold">（1）主谓关系：学生：学习。</div>
          <div class="bold">（2）动宾关系：学习：功课。</div>
          <div class="bold">（3）主宾关系：学生：功课。</div>
        </section>
      </section>
      <section>
        <h2 id="ca3">定义判断（先跳过了）</h2>
        <p>每道题<span class="err">先给出一个概念的定义</span>，然后分别列出四种情况，要求报考者严格依据定义选出一个<span class="err">
          最符合或最不符合的</span>该定义的答案。</p>
        <div class="bold">解题思路：</div>
        <p>1. 看提问方式：“属于/符合”、“不属于/不符合”</p>
        <p>2. 看题干：识别有效选项（找准关键词、关键句）</p>
        <p>3. 看选项：当纠结时采用对比的思维进行排除，最终选择更符合题干要求的选项。</p>
        <div class="bold">考点：</div>

        <section>
          <h3 id="ch3-1">1. 快速识别有效信息</h3>
          <p>方法一：关键词【主体（行为、活动的发出者）、客体（行为、活动作用的对象）】：主体都不对直接排除</p>
          <p>常识：</p>
          <p>（1）权利机关：全国人民代表大会、地方各级人民代表大会等</p>
          <p>（2）司法机关：法院、检察院等</p>
          <p>（3）行政机关：国务院、地方各级人民政府、各种局（公安局、税务局、交通局等）、街道办等。</p>

          <p>方法二：句式之“条件 + 结果”</p>
          <p>通过/利用（方式）...；因为/由于（原因）...；当...时、在...阶段（时间）；以/达到...（目的）；导致/从而（结果）...</p>

          <p>方法三：1. 优先看概念所在的那句话的句号前；2.注意句号后的补充说明【即/也就是说】。</p>
        </section>
        <section>
          <h3 id="ch3-2">2. 小技巧：同构选项【意思相近、结构相似的选项】排除法</h3>
        </section>
      </section>
      <section>
        <h2 id="ca4">逻辑判断</h2>

      </section>
    </main>
  </div>
</template>

<script>
export default {
  name: 'inference',
  data() {
    return {
      createdTime: '2019-03-07 15:22:00',
      aside: false,
      catalog: '目录',
      catalogs: [
        { id: 'ca1', text: '图形推理：', children: [
          { id: 'ch1-1', text: '位置规律' },
          { id: 'ch1-2', text: '样式规律' },
          { id: 'ch1-3', text: '属性规律' },
          { id: 'ch1-4', text: '数量规律' },
          { id: 'ch1-5', text: '空间重构' },
        ]},
        { id: 'ca2', text: '类比推理', children: [
          { id: 'ch2-1', text: '语义关系' },
          { id: 'ch2-2', text: '逻辑关系' },
          { id: 'ch2-3', text: '语法关系' },
        ] },
        { id: 'ca3', text: '定义判断（先跳过了）', children: [
          // { id: 'ch3-1', text: '快速识别有效信息' },
          // { id: 'ch3-2', text: '逻辑关系' },
          // { id: 'ch3-3', text: '语法关系' },
        ]  },
        { id: 'ca4', text: '逻辑判断' },
      ]
    }
  },
  components: {
    
  },
  mounted() {
  },
  computed: {
  },
  methods: {
    showAside() {
      this.aside = !this.aside
      this.aside ? this.catalog = '隐藏' : this.catalog = '目录';
    },
    hideCatalog() {
      this.aside = false
      this.catalog = '目录'
    }
  }
}
</script>

<style scoped lang="scss">

</style>
