<template>
  <div class="app-box">
    <aside :class="aside? 'aside':'none-aside'">
      <h1 @click="showAside">{{ catalog }}</h1>
      <ol>
        <li v-for="item in catalogs" :key="item.id">
          <a :href="'#'+item.id">{{ item.text }}</a>
          <div v-if="item.children">
            <div v-for="el in item.children" :key="el.id">
              <a :href="'#'+el.id">{{ el.text }}</a>
              <div v-if="el.items">
                <div v-for="list in el.items" :key="list.id" class="padding-left10">
                  <a :href="'#'+list.id">{{ list.text }}</a>
                </div>
              </div>
            </div>
          </div>
        </li>
      </ol>
    </aside>
    <section @click="hideCatalog">
      <p>分略读 和 详读。</p>
      <h1 id="ca1">片段阅读</h1>
      <p>题型：一段文字+提问方式+四个选项</p>
      <p>1、先看提问方式；2、带着问题读文段</p>
      <p>对比选项，择优 的思维</p>
      <p>自我总结：一般选项能在文段中找到，分析其位置，判断是否是中心意思。</p>
      <p class="err">重点：不明确的一定不能选。</p>
      <section>
        <h2 id="ch1-1">中心理解题（10道左右）</h2>
        <h3 class="bold">提问方式</h3>
        <p>这段文字 主要/旨在/重在/意在/想要说明/主旨（已经跟意图没有区别）/主题/观点/概括最佳当。</p>
        <p class="err">注意 与主旨无关 的提问方式。</p>
        <h3 class="bold">解题思路</h3>
        <p>1、重点词语：关联词、主题词、程度词</p>
        <p>2、行文脉络：指的是文段的写作思路或者文章的结构</p>
        <p>先找关联词（转折、因果），再看主题词、程度词，结合行文脉络。</p>

        <h3>关联词</h3>
        <div class="bold" id="it1-1-1">转折关系：</div>
        <p>虽然...但是...；尽管...可是...；...不过...；...然而...；...却...；其实/事实上/实际上...；殊不知...；
          截然不同；截然相反；全新的研究；一种误读；相对而言；
        </p>
        <p>转折之后是重点，结合行文脉络</p>
        <p>以【近年来】开头，说明这句话说明背景，略读，读出文章话题。以【比如、如】开头，说明这句话是在举例子，作用是加强论证。</p>
        <p>选项中，转折之前的内容不能选（非重点）；优选表述明确的选项（对比其他选项得来）</p>
        <p>常见挖坑方式：1、无中生有；2、非重点的表述；3、优先相对温和的表述，过于绝对的一般不选；4、优选表述明确的选项。（对比选项得出明确选项，比如一个选项有利于，一个选项不利于，那优选有利于）</p>
        <p>逆向思维：如果转折之后内容太多，占用太多时间，就可以用逆向思维，将转折前的内容反过来。</p>
        <p>使用题型文段特征：“很多人/大多数人都以为”、“不少人/传统观点认为” + 转折表述。</p>

        <div class="bold" id="it1-1-2">因果关系：</div>
        <p>因为...所以...；由于...因此...；因而...；故而...；于是...；可见...；看来...</p>
        <p>导致/致使/使得/造成...（后面跟一些不好的结果）；</p>
        <p>选项中出现为什么/为何，后面跟的是结果（比如：欧阳为什么迟到。结果是迟到。）</p>
        <p>如果结论词出现在尾句：大部分情况下是对前文的总结，其之后是文段的中心。</p>
        <p>如果结论词出现在开头/中间，之后仍有其他语句。</p>
        <p>1、之后的语句是进一步解释说明，此时中心句仍是结论句。</p>
        <p>2、之后又出现并列、因果、转折，需结合多种关联词共同分析。（因为我爱吃，所以我很胖，但是我嫁出去了（中心）。）</p>
        <p>结论是重点。</p>
        <p>不明确的选项一定不能选。</p>
        
        <div class="bold" id="it1-1-4">必要条件关系：</div>
        <p>只有...（重点）才...</p>
        <p>必要条件是重点。必要条件即是“只有”和“才”之间的部分。</p>
        <p>言语中不会考充分条件（只要...就...），这种表述过于绝对。</p>
        <p>【最新考点】：省略“只有”（比如：“只有好好学习，才能天天向上。”和“好好学习，才能天天向上。”）</p>

        <div class="bold" id="it1-1-5">对策：</div>
        <p>必要条件的变形。“只有好好学习，才能天天向上”->“”</p>
        <p>对策标志词:</p>
        <p>1、应该、应当、必须、需要、亟待、亟待 + 做法 （情态动词引导对策）</p>
        <p>2、通过/采取...手段/途径/措施/方式/方法/渠道，才能...（通过名词引导对策）</p>
        <p>3、呼吁、倡导、提倡、提醒、建议 + 做法 （通过动词引导对策）</p>
        <p>4、前提、基础、保障（通过名词引导对策，出现频率少）“好好学习是天天向上的前提”</p>
        <p>对策行文脉络：</p>
        <p>1、提出问题-分析问题-<span class="err">解决问题</span>（对策，重点）</p>
        <p>2、对策（重点）+正反论证/原因论证</p>
        <p>3、提出问题-<span class="err">解决问题</span>（对策，重点）-意义效果</p>
        <p>【补充技巧】：例子本身不重要，但是如果做题发现中心句似乎很难理解，这时候可以通过例子来帮助理解，从而得到答案。</p>
        <p>当文段中只有“提出问题-分析问题”的部分时，“解决问题”通常会作为正确答案出现在选项里。</p>
        <div class="bold">反面论证思维：</div>
        <p>典型格式：如果/倘若/一旦...（这里反过来就是正确答案） + 不好的结果</p>
        <p>把前面的做法反过来，即为正确答案</p>
        <p>【注意】：既有正面对策又有反面论证，那么答案就是正面对策，没有正面对策的时候再把反面论证反过来。</p>

        <div class="bold" id="it1-1-7">并列关系：</div>
        <p>没有侧重，概括全面完整</p>
        <p>文段特征：</p>
        <p>1、包含并列关联词。如：此外、另外、同时、以及、“；”</p>
        <p>2、层次分明，格式工整。</p>
        <p>3、无明显其他关联词语。</p>
        <p>选项特征：</p>
        <p>1、两方面情况：和、及、与、同</p>
        <p>2、更多种情况：许多、一些、不同、各种、一系列</p>
        <p>当分句表达的意思相同，则提取共性。</p>

        <h3 id="it1-1-3">主题词</h3>
        <p>起一个辅助功能。当觉得题目太难时，就使用这个技巧。</p>
        <div class="bold">主题词特征：</div>
        <p>1、文段围绕其展开</p>
        <p>2、一般高频出现（主题词可能被指代为 其/该/它）</p>
        <p>3、大多为名词</p>
        <p>4、前有引入，后有解释说明</p>
        <p>常见挖坑方式：1、概念扩得太大（即选项不明确）；</p>

        <h3 id="it1-1-6">程度词</h3>
        <p>起一个辅助功能。当觉得题目太难时，就使用这个技巧。</p>
        <div class="bold">标志词：</div>
        <p>更、尤其、正是、特别是、真正、根本、最核心/突出等</p>
        <p>程度词所在的语句通常为重点。</p>
        <p>开头部分大多是引出话题、或某概念。</p>

        <h3 id="it1-1-8">行文脉络</h3>
        <div class="bold">五种行文脉络：</div>
        <p>1、总 -- 分       （对策 + 原因 / 观点 + 解释说明（例如...））</p>
        <p>2、分 -- 总       （结论。对策 / 末尾因此... / 代词“这”、“此”引导的尾句需关注。）</p>
        <p>3、总 -- 分 -- 总</p>
        <p>4、分 -- 总 -- 分 （随着...但是...例如...）</p>
        <p>5、分 -- 分       （并列结构）</p>
        <p>把握<span class="err">中心句</span>及<span class="err">分述句</span>的特点。</p>
        <p>当中心句不太好确认时，再去找分述句。</p>
        <div class="bold">中心句特征：</div>
        <p>观点（对策、结论、评价）</p>
        <div class="bold">分述句特征（作用：加强论证）：</div>
        <p>1、举例子：“比如”、“例如”、“...就是例证”等</p>
        <p>2、调查报告、数据资料等</p>
        <p>3、正反论证 （对策 + 正反论证）</p>
        <p>4、原因解释</p>
        <p>5、并列分述</p>
        <p>分述句中出现的关联词（但是...、因此...）并不代表重点。</p>
      </section>
      <section>
        <h2 id="ch1-2">细节判断题</h2>
        <p>一般较晦涩难懂。通读全文，定位选项。</p>
        <h3>提问方式</h3>
        <p>“以下对文段理解正确/<span class="err">不</span>正确的是...”；“符合/不符合这段话意思的是...”；
        “从文段中可以得知/推出的是...”</p>
        <h3>典型细节题</h3>
        <div class="bold">错误选项类型：</div>
        <p>1、无中生有</p>
        <p>2、偷换概念（替换概念、混搭概念）</p>
        <p>3、偷换时态：将来时（将要、立刻、趋势、以后）；完成时（已、已经、了、完成）；进行时（正在...、在...中、着）</p>
        <p>4、绝对表述</p>
        <p>表述太绝对要注意（“最”）。回答这种题并不是总结全文，而是拎出部分，比较是否正确。</p>
        <p>当选项中的内容都不超过5个字时，看完提问方式后看选项，再读全文。</p>

        <h3 id="it-1-2-1">相对绝对法</h3>
        <p>当提问说法正确时，先看相对标志词的选项，优先验证，快速答题；当提问说法错误时，先看绝对标志词的选项。</p>
        <div class="bold">绝对标志词（大概率是错误选项）：</div>
        <p>一定、全部、完全、所有、均、永远、任何、取代、主导、唯一、只要...就...、无论...都...</p>
        <div class="bold">相对标志词（大概率是正确选项）：</div>
        <p>可能、也许、或许、大概、一般、尽量、往往、容易、...之一、我永远支持共产党。</p>

        <h3 id="it1-2-2">细节主旨化</h3>
        <p>优选契合主旨的选项（先按着中心理解题来找主旨）。此方法不常用。</p>
      </section>
    </section>
    <section @click="hideCatalog">
      <h1 id="ca2">语句表达</h1>
      <section>
        <h2 id="ch2-1">语句排序题（2-3题）</h2>
        <h3>提问方式不用关注</h3>
        <p>出现 1 2 3...的序号排序就是语句排序题。</p>
        <p>解题时要从选项入手。技巧性很强。不要靠语感。</p>
        <h3>解题3步走战略</h3>
        <p>一、看选项，对比后确定首句。</p>
        <p>二、（1）确定捆绑集团【中间不允许有另一句话】（2）确定顺序【中间可以有其他语句，但是顺序不能调换】（3）确定尾句【对比确定】</p>
        <p>三、验证自己锁定的正确答案。</p>
        
        <h3>确定首句</h3>
        <div class="bold">1、背景引入</div>
        <p>关键词：随着、近年来、在...大背景下/环境下</p>
        <p>先看关键词，再对比选项确定首句。</p>
        <div class="bold">2、提出观点</div>
        <p>关键词：有人说、人们普遍认为</p>
        <p>先看关键词，再对比选项确定首句。</p>
        <div class="bold">3、下定义</div>
        <p>关键词：...就是/是指</p>
        <p>先看关键词，再对比选项确定首句，对比首句的时候，先看形式（观点/定义），但还要注意内容。</p>
        <div class="bold">4、非首句特征</div>
        <p>（1）关联词后半部分（2）指代词【人称代词：它/他/她；指示代词：这/那】</p>
        <p>先看关键词，再对比选项确定首句。</p>

        <h3>确定捆绑集团</h3>
        <div class="bold">1、指代词捆绑</div>
        <p>关键词：这、那、他、该、其；每一次、每一类型、每一XX（前有多个内容）</p>
        <div class="bold">2、关联词</div>
        <p>关键词：1、配套出现：不但...而且；（太简单，基本不会这么考）2、单独出现：但、同时</p>
        <div class="bold">3、共同信息捆绑</div>
        <p>关键词：找特殊信息捆绑。</p>

        <h3>确定顺序</h3>
        <div class="bold">1、时间顺序</div>
        <p>年份、朝代、以前...现在...</p>
        <p>不用考虑倒叙、插叙的问题。</p>
        <div class="bold">2、逻辑顺序</div>
        <p>1、行文脉络：先观点+再举例；先提出问题+再提出对策</p>
        <p>2、A和B（并列结构）：应该先说A，再说B</p>

        <h3>确定尾句</h3>
        <p>结论+对策</p>
        <p>关键词：因此、所以、看来、于是、这、应该、需要</p>
      </section>
      <section>
        <h2 id="ch2-2">语句填空题（2-3题）</h2>
        <p>只要会技巧，就能做出来</p>
        <h3>提问方式单一：填入横线部分最恰当的是</h3>

        <h3>横线在结尾</h3>
        <p>分 --  总 结构。1、总结前文；2、提出对策。（类似中心理解题）</p>
        <p>要保持前后话题一致。</p>

        <h3>横线在开头</h3>
        <p>总 -- 分 结构。需概括文段的中心内容。</p>

        <h3>横线在中间</h3>
        <p>承上启下的作用。注意与上下文联系。把握好主题词，保证文段话题一致。</p>
      </section>
      <section>
        <h2 id="ch2-3">接语选择题（1题）</h2>
        <p>难度不高，送分题。</p>

        <h3>提问方式</h3>
        <p>作者接下来最可能讲述的是（）</p>

        <h3>解题要点</h3>
        <p>重点关注文段最后一句话。</p>
        <p>1、有且仅有一个选项与尾句话题一致，则直接选；</p>
        <p>2、如果有两个及两个以上选项与尾句话题一致，那就需要结合前文分析。</p>
        <p>干扰项特征：文段中已经论述过得内容（容易把这类题当做中心理解题来做，所以中心句一定不是正确答案。）</p>
        <p>文段提出问题，选项中既有原因又有对策，则选原因。</p>

      </section>
    </section>
    <section @click="hideCatalog">
      <h1 id="ca3">逻辑填空（10-20道）</h1>
      <p>题量最大，难度最高。忌语感。对词汇量要求高。通过刷真题的方式去积累词汇量（宠词（本省））</p>
      <section>
        <h2 id="ch3-1">词的辨析（选项角度）</h2>

        <h3>1. 词义侧重（考的较少）</h3>
        <p>形近音近词：品行、品性</p>
        <div class="bold">方法：</div>
        <p>1、拆字组词：行为、性格</p>
        <p>2、整体搭配：拆字不好拆时：品行端正、品行纯良</p>

        <h3>2. 固定搭配（重要）</h3>
        <p>凝聚共识、考量影响、延误时机、施展才华、活力迸发、大自然的鬼斧神工（通常形容大自然，也可以用来形容建筑、雕塑）
          、人的精雕细刻、人的巧夺天工、人的匠心独运、摄入（具体营养）、汲取（文化营养）、奉为圭臬niè、
          同日而语（同一类对比）、相提并论（有差距的两个事物放在一起谈论）、无法望其项背=望尘莫及、
          旷日持久（强调时间长）、山穷水尽（表示没了）、左支右绌chù（力量不足，应付不过来）、羁绊（缠住不能脱身，束缚）、
          贻笑大方（让内行人笑话）、钳制（不能钳制自己）、分歧（两个以上的观点才有分歧）、门口罗雀（主语一般为地方）、
          疾言厉色（人发火时的面貌）、如临大敌（好像面对这强大的敌人。）、守望相助（面对困难、灾祸时共同面对）、
          无与伦比（好到了极点，过于绝对，一般不是正确选项）、和而不同（和睦地相处,但不随便附和）、执迷不悟（不悔改）、
          一意孤行（行动上，而不是心理上）、独树一帜（独自树立一种风格，与众不同）、相形见绌（两个事物对比显出不足）、
          力所不逮（能力达不到）、经天纬地（形容有治理天下的经世之才）、汪洋恣肆（形容文章、言论书法等气势豪放，潇洒自如）、
          戎马倥偬kǒng zǒng（形容军务繁忙）</p>
        <div class="bold">1、常用词搭配：</div>
        <p>爱护（人[对晚辈]、物）/爱戴（人[对领导]）；（物种、人烟、头发）稀少/（资源）稀缺</p>
        <div class="bold">2、热点词搭配：</div>
        <p>经济新常态、供给侧结构性改革、京津冀协同发展...（和申论一起积累）</p>

        <h3>3. 程度轻重（对比选项确定）</h3>
        <p>所填词语的程度与文段意思的轻重保持一致。比如：缺陷>缺点>瑕疵；截然相反>大相径庭；尴尬程度：羞愧难当>窘态百出</p>

        <h3>4. 感情色彩（对比选项确定）</h3>
        <p>成果（积极地）、结果（中性）、后果（消极的）；趋之若鹜（追逐一些不好的东西）、争先恐后（追逐一个好的东西）；
          同舟共济（积极）、狼狈为奸（消极）、造成（不好的结果）、导致（不好的结果）、引发（中性词【热议、思考、洪水】）、
          陪衬（中性词）、随从（中性词，随行人员）
        </p>

      </section>
      <section>
        <h2 id="ch3-2">语境分析（文段角度）</h2>

        <h3>关联关系</h3>
        <p>转折、递进、并列</p>
        <div class="bold">1、转折</div>
        <p>但。</p>
        <p>前后语义相反，但不能矛盾。【虽然我很丑，但是我很温柔（不能是漂亮，因为这样前后矛盾了。）】</p>
        <div class="bold">2、递进</div>
        <p>而且、甚至</p>
        <p>语义程度前轻后重。</p>
        <div class="bold">3、并列</div>
        <p>（1）同义并列：顿号（、）；逗号（，）；</p>
        <p>（2）反义并列：不是...而是...；是...不是...；相反...；反之...；</p>

        <h3>对应关系</h3>
        <p>解释类、重点词句</p>
        <div class="bold">1、解释类对应</div>
        <p>标志词：是、就是、即、无异于、无疑是、比如、例如、冒号（：）、破折号（———）等</p>
        <div class="bold">2、重点词句的对应</div>
        <p>重点词：指代词、主题词、形象表达；重点句：中心句。</p>
        <p>重点词句之指代词：这、此。</p>
        <p>重点词句之主题词（文段核心话题），所填词语与主题词形成对应。</p>
        <p>重点词句之形象表达：比如、就像、类似、“”，所填词语要与形象表达的词语形成对应。</p>

      </section>
      <section>
        <h2 id="ch3-1"></h2>
      </section>
    </section>
  </div>
</template>

<script>
export default {
  name: 'speechComprehension',
  data() {
    return {
      createdTime: '2019-03-04 12:10:00',
      catalogs: [
        {id: 'ca1', text: '片段阅读：', children: [
          {id: 'ch1-1', text: '中心理解题', items: [
            {id: 'it1-1-1', text:'转折关系'},
            {id: 'it1-1-2', text:'因果关系'},
            {id: 'it1-1-4', text:'必要条件关系'},
            {id: 'it1-1-5', text:'对策标志词'},
            {id: 'it1-1-7', text:'并列关系'},
            {id: 'it1-1-3', text:'主题词'},
            {id: 'it1-1-6', text:'程度词'},
            {id: 'it1-1-8', text:'行文脉络'},
          ]},
          {id: 'ch1-2', text: '细节判断题', items: [
            {id: 'it1-2-1', text:'相对绝对法'},
            {id: 'it1-2-2', text:'细节主旨化'},
          ]},
        ]},
        {id: 'ca2', text: '语句表达：',children: [
          {id: 'ch2-1', text: '语句排序题（2-3题）'},
          {id: 'ch2-2', text: '语句填空题（2-3题）'},
          {id: 'ch2-3', text: '接语选择题（1题）'},
        ]},
        {id: 'ca3', text: '逻辑填空', children: [
          {id: 'ch3-1', text: '词的辨析（选项角度）'},
          {id: 'ch3-2', text: '语境分析（文段角度）'},
        ]},
      ],
      aside: false,
      catalog: '目录'
    }
  },
  components: {
    
  },
  mounted() {
  },
  computed: {
  },
  methods: {
    showAside() {
      this.aside = !this.aside
      this.aside ? this.catalog = '隐藏' : this.catalog = '目录';
    },
    hideCatalog() {
      this.aside = false
      this.catalog = '目录'
    }
  }
}
</script>

<style scoped lang="scss">

</style>
